[
  {
    "content": "Vivek Padayattil\nCurriculum Vitae\nData Scientist with 2 years of experience building end-to-end ML solutions from data preparation to production\ndeployment. Expert in designing scalable ML pipelines, optimizing model performance, and deploying cloud-based\napplications. Strong foundation in Python, deep learning frameworks, and MLOps practices. Background in\nmechanical engineering provides unique insight into manufacturing and design automation workflows.\nPersonal Information\nDate of Birth May 12th, 1994\nVisa German Permanent Residence\nAddress Markgrafenweg 4, Günzburg 89312\nContact +49 1727026761\nE-mail vivekpadayattil@gmail.com\nGithub vivupadi\nExperience\nWork Experience\n06/2023 - PresentData Scientist,VitaScale GmbH,Mainz, Germany\nProject 1: Breath Alcohol Detection System\n{Built ETL workflows to clean, process, and store sensor data in MySQL\n{Designed & implemented a continuous Breath Alcohol Concentration prediction model\nusing electrochemical sensors, achieving 88% accuracy\n{Integrated MLflow for experiment tracking and model versioning, automating preprocessing\n& training via CI/CD\n{Developed GUI tools using PyQt & Tkinter for data visualization and sensor analytics\nProject 2: Marketing Analytics & Automation\n{Built Flask-based automation tool integrating Calendly and MailerLite APIs, hosted on\nRender\n{Conducted A/B testing and audience segmentation to optimize ad campaigns, increasing\nconversion rates\n{Designed a data-driven landing page that contributed to successful crowdfunding\nProject 3: RAG-based Chatbot\n{Developed a retrieval-augmented generation system using web scraping, vector embeddings\n(Pinecone), and LangChain\n{Deployed the chatbot on Azure for secure, scalable enterprise usage\n{Automated data ingestion and knowledge base updates for continuous improvement\nMarkgrafenweg 4, Günzburg 89312\nH+49 1727026761•Bvivekpadayattil@gmail.com 1/2",
    "metadata": {
      "source": "D:\\Chat\\data\\raw\\Vivek_Padayattil_CV__Data_Science.pdf",
      "page": 1,
      "type": "pdf"
    }
  },
  {
    "content": "07/2016 - 08/2018 Procurement Engineer,Furnace Fabrica India Ltd,Navi Mumbai, India\n{Managed procurement strategies, ERP-based inventory control, and vendor development\n{Coordinated with cross-functional teams to ensure material compliance for global projects\nResearch and Projects\n02/2022 - 11/2022Master Thesis,FPGA Prototype of Neural Network Based Cardiovascular Disease Detection\nfor Rescue Patients, University of Siegen\no Implemented ANN on Pynq Z2 FPGA using Apache TVM for real-time predictions\noCompared ANN, SVM, GBM, and RF models; visualized performance metrics in Tableau\n09/2020 - 08/2021 Master Project,Deep Embedded Clustering of Bars and Wires Hot Rolling Parameters,\nUniversity of Siegen\noClustered hot rolling process parameters using Deep Embedded Clustering architecture;\nimplemented autoencoder-based deep embedded clustering architecture for unsupervised\nlearning\nAudio transcription tool(Github)\noDjango-based speech-to-text app using Hugging Face models, deployed with CI/CD on\nRender\nComputer Vision - Semantic Segmentation(Github)\noIntegrated pre-trained segmentation model into production-ready application for object\ndetection\nEducation\n2018 - 2022M.Sc. in Mechatronics,University of Siegen, Germany\n2012 - 2016B.E. in Mechanical Engineering,Univeristy of Mumbai, India\nCore Skills\nProgrammingPython, SQL, MatLab, JavaScript (Basic)\nMachine\nLearning & AISupervised/Unsupervised Learning, Deep Learning, NLP, Computer Vision, Model Evaluation,\nHyperparameter Tuning, Model Deployment, Model Monitoring, Feature Engineering, A/B\nTesting, TensorFlow, PyTorch, Keras, Hugging Face, LangChain, NLTK\nData Analytics Tableau, EDA, Seaborn, Matplotlib, Plotly, Statistical Analysis, Apache Spark, KPI Tracking,\nBusiness Insights, Hypothesis Testing\nMLOpsMLflow, CI/CD, Docker, Kubernetes, Data Versioning, Pipeline Automation\nFrameworksFlask, Django, Streamlit, PyQt, Tkinter, Linux, Agile-SCRUM, Git, Carrd, Wordpress\nCloud PlatformsMicrosoft Azure, Render, Pinecone\nDomain\nKnowledgeCAD software (AutoCAD, SolidWorks, Pro-E/Creo), Manufacturing processes\nLanguages\nFluent English, Malayalam, Hindi, Marathi\nIntermediate German (B1/B2) Fluent in communicative aspect\nCourses and Licences\no Azure Data Scientist Associate(Microsoft Certified)\no Coursera: Convolutional Neural Network, Neural Networks and Deep Learning\nMarkgrafenweg 4, Günzburg 89312\nH+49 1727026761•Bvivekpadayattil@gmail.com 2/2",
    "metadata": {
      "source": "D:\\Chat\\data\\raw\\Vivek_Padayattil_CV__Data_Science.pdf",
      "page": 2,
      "type": "pdf"
    }
  },
  {
    "content": "Vivek Padayattil Portfolio Vivek Padayattil DOB: 12th May, 1994 Visa: German Permanent Resident Address: Günzburg, 89312 Mobile: +49 1727026761 Mail ID: vivekpadayattil@gmail.com English Resume German Resume Chat & Know ***Chat & Know is hosted on Azure Container Instance. To counter unnecessary costs, the container registry is kept off all the time. Mail to check the functionality Read More About Me Hi, I’m Vivek Padayattil— a data-driven problem solver with a strong background in data science, AI, and cloud technologies. I enjoy turning raw data into meaningful insights and building intelligent applications that create real business value. With hands-on experience in Python, SQL, machine learning, and MLOps, I specialize in designing and deploying AI solutions on the cloud, particularly using Microsoft Azure. I hold the Azure Data Scientist Associate (DP-100) and preparing for the Azure AI Engineer Associate (AI-102) certifications, which reflect my expertise in developing, deploying, and scaling AI models responsibly. Beyond data science, I am expanding my skills in DevOps and Kubernetes, enabling me to bridge the gap between AI development and reliable production deployment. I enjoy working on end-to-end projects — from data preprocessing and modeling to deployment and monitoring. When I’m not coding, I’m either exploring new technologies, learning about LLM-based applications, or experimenting with side projects that combine AI, software engineering, and automation. I thrive in collaborative environments where I can contribute to impactful projects, continuously learn, and help shape innovative solutions. Read More Experience 06/2023 - Present Data Scientist, VitaScale GmbH, Mainz, Germany Project 1: ML Model for Open Environment Breath Alcohol Concentration Detection Project 2: RAG based Chatbot Project 3: Marketing Analytic & Automation 06/2016 - 08/2018 Purchase Engineer, Furnace Fabrica India Ltd, Navi Mumbai Demonstrated sound expertise in inventory management, ERP systems, and quality control Successfully spearheaded procurement plans, vendor development, and departmental coordination for multiple national and international projects Read More Technical Skills Programming Languages: Python, SQL, Pandas, NumPy, Scikit-learn, TensorFlow, PyTorch, Keras, Apache Spark, Hugging Face, LangChain, NLTK, Feature Engineering, ETL, Data Cleaning, Data Wrangling, Statistical Analysis, EDA, Data Modeling Data Engineering: Data Engineering, ETL Pipelines, Data Warehousing, Data Lakes, Data Modeling, SQL Optimization, API Integration, Data Governance, Data Versioning Data Analytics & BI: Tableau, Power BI, Plotly, Seaborn, Matplotlib, KPI Dashboards, Business Reporting, A/B Testing, Hypothesis Testing, Exploratory Data Analysis (EDA) MLOps & DevOps: MLflow, Docker, Kubernetes, Azure, GitHub Actions, CI/CD, Model Deployment, Model Monitoring, Nginx, Scalability Frameworks & Tools: Flask, Django, Streamlit, PyQt, Tkinter, Linux, Agile-SCRUM, Git Cloud Platforms: Microsoft Azure, Render, Pinecone, Azure Cognitive Services Languages: German(B1/B2); English(Fluent); Malayalam(Fluent); Hindi(Fluent); Marathi(Fluent) Soft Skills Communication Problem-Solving & Critical Thinking Collaboration and Teamwork Data Storytelling and Visualization Time Management Continue Reading Education Master of Science in Mechatronics University of Siegen, Germany 10/2018 - 11/2022 Bachelor of Engineering in Mechanical University of Mumbai, India 06/2012 - 08/2016 Research Project Master Thesis: FPGA Prototype of Neural Network Based Cardiovascular Disease Detection for Rescue Patients Master Project: Deep Embedded Clustering of Bars and Wires Hot Rolling Parameters Additional Certifications Microsoft Certified: Azure Data Scientist(Certificate) Digital Manager Social Media Neural Networks and Deep Learning (Coursera Certificate) Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization (Coursera Certificate) Convolution Neural Network (Coursera Certificate) Machine Learning (Coursera Certificate) Read More RAG based Chatbot Resume ATS Tracker Sentiment Analysis App Formula 1 Dashboard Semantic Segmentation on real-time video Object Detection on Images and Videos Audio Transcription using Django Address: Günzburg - 89312 Mobile: +49 1727026761 Email: vivekpadayattil@gmail.com Copyright © 2025 Vivek Padayattil",
    "metadata": {
      "source": "https://www.vivekpadayattil.com/",
      "type": "website"
    }
  }
]